settings/PDB_TEST_SENARIO.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <stringProp name="TestPlan.user_define_classpath">D:\자료\JMETER\apache-jmeter-5.4.1\apache-jmeter-5.4.1\lib</stringProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">20</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC Connection Configuration" enabled="true">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">goldPool</stringProp>
          <stringProp name="dbUrl">jdbc:goldilocks://192.168.0.73:22581/test?failover_type=session&amp;alternate_servers=192.168.0.77:22581,192.168.0.73:22581&amp;statement_pool_on=1&amp;statement_pool_size=10</stringProp>
          <stringProp name="driver">sunje.goldilocks.jdbc.GoldilocksDriver</stringProp>
          <boolProp name="keepAlive">false</boolProp>
          <stringProp name="password">test</stringProp>
          <stringProp name="poolMax">20</stringProp>
          <boolProp name="preinit">true</boolProp>
          <stringProp name="timeout">1000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">1000</stringProp>
          <stringProp name="username">test</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </LoopController>
        <hashTree/>
        <UserParameters guiclass="UserParametersGui" testclass="UserParameters" testname="User Parameters" enabled="true">
          <collectionProp name="UserParameters.names">
            <stringProp name="-940221023">r_keys</stringProp>
            <stringProp name="917919409">r_keys2</stringProp>
            <stringProp name="-793496321">param_1</stringProp>
          </collectionProp>
          <collectionProp name="UserParameters.thread_values">
            <collectionProp name="-874467287">
              <stringProp name="-1419502321">${__RandomString(51,0123456789abcdef)}</stringProp>
              <stringProp name="-703230969">${__RandomString(12,0123456789)}</stringProp>
              <stringProp name="-197672344">${__RandomString(11,0123456789)}</stringProp>
            </collectionProp>
          </collectionProp>
          <boolProp name="UserParameters.per_iteration">true</boolProp>
        </UserParameters>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="T_5G_SUBS_SERVICE_I" enabled="true">
          <stringProp name="dataSource">goldPool</stringProp>
          <stringProp name="queryType">Prepared Update Statement</stringProp>
          <stringProp name="query">INSERT INTO T_5G_SUBS_SERVICE VALUES (?,&apos;DATA_USAGE_LEVEL&apos;,&apos;0&apos;,&apos;N&apos;,&apos;20220930080000&apos;,&apos;20220930080000&apos;,&apos;null&apos;,&apos;Y4&apos;,&apos;00000101000000&apos;,&apos;99991231000000&apos;,&apos;null&apos;,&apos;A&apos;,&apos;20221101000000&apos;,&apos;N&apos;,&apos;manual insert[20221027012345]&apos;);</stringProp>
          <stringProp name="queryArguments">${param_1}</stringProp>
          <stringProp name="queryArgumentsTypes">varchar</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="T_5G_SUBS_SERVICE_U" enabled="true">
          <stringProp name="dataSource">goldPool</stringProp>
          <stringProp name="queryType">Prepared Update Statement</stringProp>
          <stringProp name="query">UPDATE T_5G_SUBS_SERVICE SET &quot;LIMIT&quot;=&apos;A&apos;, JOB_CODE=&apos;H1&apos; WHERE MDN=? AND SVC_ID=&apos;DATA_USAGE_LEVEL&apos;);</stringProp>
          <stringProp name="queryArguments">${param_1}</stringProp>
          <stringProp name="queryArgumentsTypes">varchar</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="T_5G_SUBS_SERVICE_S" enabled="true">
          <stringProp name="dataSource">goldPool</stringProp>
          <stringProp name="queryType">Prepared Select Statement</stringProp>
          <stringProp name="query">SELECT * FROM T_5G_SUBS_SERVICE WHERE MDN=? AND SVC_ID=&apos;DATA_USAGE_LEVEL&apos;;</stringProp>
          <stringProp name="queryArguments">${param_1}</stringProp>
          <stringProp name="queryArgumentsTypes">varchar</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="T_5G_SUBS_SERVICE_D" enabled="true">
          <stringProp name="dataSource">goldPool</stringProp>
          <stringProp name="queryType">Prepared Update Statement</stringProp>
          <stringProp name="query">DELETE FROM T_5G_SUBS_SERVICE WHERE MDN=?;</stringProp>
          <stringProp name="queryArguments">${param_1}</stringProp>
          <stringProp name="queryArgumentsTypes">varchar</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="T_PCF_BINDING_INFO_i" enabled="true">
          <stringProp name="dataSource">goldPool</stringProp>
          <stringProp name="queryType">Prepared Update Statement</stringProp>
          <stringProp name="query">INSERT INTO  T_PCF_BINDING_INFO VALUES (?,
&apos;imsi-450050209933638&apos;,
&apos;450050209933638&apos;,
&apos;msisdn-821020993638&apos;,
?,
&apos;01020993638&apos;,
&apos;50.15.4.120&apos;,                                                 
&apos;5g.sktelecom.com&apos;,
&apos;200&apos;,
&apos;000001&apos;,
&apos;45005&apos;,
&apos;pcf01-mp04-app02&apos;,
&apos;&apos;,
&apos;{&quot;ipv4Address&quot; : &quot;100.100.150.10&quot;,&quot;ipv6Address&quot; : null,&quot;port&quot; : 16101},{&quot;ipv4Address&quot; : &quot;100.100.150.11&quot;,&quot;ipv6Address&quot; : null,&quot;port&quot; : 16101},&apos;,
&apos;http://100.100.150.10:16101,http://100.100.150.11:16101,&apos;,
&apos;592fe074-6aca-4f0d-b3b3-131213121312&apos;,
&apos;&apos;,
&apos;&apos;,
&apos;20220901&apos;,
&apos;161300&apos;)</stringProp>
          <stringProp name="queryArguments">${r_keys},${r_keys2}</stringProp>
          <stringProp name="queryArgumentsTypes">varchar,varchar</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="T_PCF_BINDING_INFO_u" enabled="true">
          <stringProp name="dataSource">goldPool</stringProp>
          <stringProp name="queryType">Prepared Update Statement</stringProp>
          <stringProp name="query">
UPDATE T_PCF_BINDING_INFO SET PCF_ID=&apos;pcf01-mp04-app03&apos;, OPEN_DATE=TO_CHAR(SYSDATE,&apos;YYYYMMDD&apos;), OPEN_TIME=TO_CHAR(SYSDATE,&apos;hhmiss&apos;) WHERE SM_POLICY_ID=? AND DNN=&apos;5g.sktelecom.com&apos;;</stringProp>
          <stringProp name="queryArguments">${r_keys}</stringProp>
          <stringProp name="queryArgumentsTypes">varchar</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="T_PCF_BINDING_INFO_s" enabled="true">
          <stringProp name="dataSource">goldPool</stringProp>
          <stringProp name="queryType">Prepared Select Statement</stringProp>
          <stringProp name="query">SELECT * FROM  T_PCF_BINDING_INFO WHERE SM_POLICY_ID= ? AND DNN=&apos;5g.sktelecom.com&apos;;</stringProp>
          <stringProp name="queryArguments">${r_keys}</stringProp>
          <stringProp name="queryArgumentsTypes">varchar</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="T_PCF_BINDING_INFO_d" enabled="true">
          <stringProp name="dataSource">goldPool</stringProp>
          <stringProp name="queryType">Prepared Update Statement</stringProp>
          <stringProp name="query">DELETE FROM T_PCF_BINDING_INFO WHERE MSISDN=?;</stringProp>
          <stringProp name="queryArguments">${r_keys2}</stringProp>
          <stringProp name="queryArgumentsTypes">varchar</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.TransactionsPerSecondGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Transactions per Second" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <longProp name="interval_grouping">1000</longProp>
          <boolProp name="graph_aggregated">true</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
        </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>